[Survived] StringLiteral
backend/routes/auth.js:85:19
 router.post(
   '/register',
   [
-    check('name', 'Name is required').not().isEmpty(),
+    check('name', "").not().isEmpty(),
     check('email', 'Please include a valid email').isEmail(),
     check('password', 'Please enter a password with 6 or more characters').isLength({ min: 6 }),

[Survived] ObjectLiteral
backend/routes/auth.js:87:85
   [
     check('name', 'Name is required').not().isEmpty(),
     check('email', 'Please include a valid email').isEmail(),
-    check('password', 'Please enter a password with 6 or more characters').isLength({ min: 6 }),
+    check('password', 'Please enter a password with 6 or more characters').isLength({}),
   ],
   async (req, res) => {

[Survived] StringLiteral
backend/routes/auth.js:87:11
   [
     check('name', 'Name is required').not().isEmpty(),
     check('email', 'Please include a valid email').isEmail(),
-    check('password', 'Please enter a password with 6 or more characters').isLength({ min: 6 }),
+    check("", 'Please enter a password with 6 or more characters').isLength({ min: 6 }),
   ],
   async (req, res) => {

[Timeout] ConditionalExpression
backend/routes/auth.js:99:11
 
     try {
       let user = await User.findOne({ email });
-      if (user) {
+      if (true) {
         return res.status(400).json({ msg: 'User already exists' });
       }

[Timeout] ConditionalExpression
backend/routes/auth.js:99:11
 
     try {
       let user = await User.findOne({ email });
-      if (user) {
+      if (false) {
         return res.status(400).json({ msg: 'User already exists' });
       }

[Killed] StringLiteral
backend/routes/auth.js:100:44
     try {
       let user = await User.findOne({ email });
       if (user) {
-        return res.status(400).json({ msg: 'User already exists' });
+        return res.status(400).json({ msg: "" });
       }
 
killedBy: Auth API POST /api/auth/register 400 → user exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "msg": "User already exists",
+   "msg": "",

[Survived] ObjectLiteral
backend/routes/auth.js:115:15
       await user.save();
 
       const payload = {
-        user: {
-          id: user.id,
-        },
+        user: {},
       };
 

[Killed] BlockStatement
backend/routes/auth.js:120:75
         },
       };
 
-      jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {
-        if (err) throw err;
-        res.json({ token });
-      });
+      jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {});
     } catch (err) {
       console.error(err.message);
killedBy: Auth API POST /api/auth/register 200 → new user
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Survived] StringLiteral
backend/routes/auth.js:120:50
         },
       };
 
-      jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {
+      jwt.sign(payload, JWT_SECRET, { expiresIn: "" }, (err, token) => {
         if (err) throw err;
         res.json({ token });

[Killed] ConditionalExpression
backend/routes/auth.js:121:13
       };
 
       jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {
-        if (err) throw err;
+        if (true) throw err;
         res.json({ token });
       });
killedBy: Auth API POST /api/auth/register 200 → new user
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Survived] ConditionalExpression
backend/routes/auth.js:121:13
       };
 
       jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {
-        if (err) throw err;
+        if (false) throw err;
         res.json({ token });
       });

[NoCoverage] BlockStatement
backend/routes/auth.js:124:19
         if (err) throw err;
         res.json({ token });
       });
-    } catch (err) {
-      console.error(err.message);
-      res.status(500).send('Server error');
-    }
+    } catch (err) {}
   }
 );

[NoCoverage] StringLiteral
backend/routes/auth.js:126:28
       });
     } catch (err) {
       console.error(err.message);
-      res.status(500).send('Server error');
+      res.status(500).send("");
     }
   }

[Killed] StringLiteral
backend/routes/auth.js:169:30
  *       500:
  *         description: Server error
  */
-router.post('/login', [check('email', 'Please include a valid email').isEmail(), check('password', 'Password is required').exists()], async (req, res) => {
+router.post('/login', [check("", 'Please include a valid email').isEmail(), check('password', 'Password is required').exists()], async (req, res) => {
   const errors = validationResult(req);
 
killedBy: Auth API POST /api/auth/login 200 → valid creds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Survived] StringLiteral
backend/routes/auth.js:169:100
  *       500:
  *         description: Server error
  */
-router.post('/login', [check('email', 'Please include a valid email').isEmail(), check('password', 'Password is required').exists()], async (req, res) => {
+router.post('/login', [check('email', 'Please include a valid email').isEmail(), check('password', "").exists()], async (req, res) => {
   const errors = validationResult(req);
 

[Killed] ConditionalExpression
backend/routes/auth.js:172:7
 router.post('/login', [check('email', 'Please include a valid email').isEmail(), check('password', 'Password is required').exists()], async (req, res) => {
   const errors = validationResult(req);
 
-  if (!errors.isEmpty()) {
+  if (true) {
     return res.status(400).json({ errors: errors.array() });
   }
killedBy: Auth API POST /api/auth/login 200 → valid creds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
backend/routes/auth.js:172:7
 router.post('/login', [check('email', 'Please include a valid email').isEmail(), check('password', 'Password is required').exists()], async (req, res) => {
   const errors = validationResult(req);
 
-  if (!errors.isEmpty()) {
+  if (false) {
     return res.status(400).json({ errors: errors.array() });
   }
killedBy: Auth API POST /api/auth/login 400 → validation errors
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Array

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
backend/routes/auth.js:178:7
 
   const { email, password } = req.body;
 
-  try {
-    let user = await User.findOne({ email });
-
-    if (!user) {
-      return res.status(400).json({ msg: 'Invalid credentials' });
-    }
-
-    const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch) {
-      return res.status(400).json({ msg: 'Invalid credentials' });
-    }
-
-    const payload = {
-      user: {
-        id: user.id,
-      },
-    };
-
-    jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {
-      if (err) throw err;
-      res.json({ token });
-    });
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server error');
killedBy: Auth API POST /api/auth/login 200 → valid creds
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Survived] ObjectLiteral
backend/routes/auth.js:179:35
   const { email, password } = req.body;
 
   try {
-    let user = await User.findOne({ email });
+    let user = await User.findOne({});
 
     if (!user) {

[Killed] BlockStatement
backend/routes/auth.js:181:16
   try {
     let user = await User.findOne({ email });
 
-    if (!user) {
-      return res.status(400).json({ msg: 'Invalid credentials' });
-    }
+    if (!user) {}
 
     const isMatch = await bcrypt.compare(password, user.password);
killedBy: Auth API POST /api/auth/login 400 → no user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
backend/routes/auth.js:186:9
     }
 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch) {
+    if (false) {
       return res.status(400).json({ msg: 'Invalid credentials' });
     }
killedBy: Auth API POST /api/auth/login 400 → wrong password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Survived] ObjectLiteral
backend/routes/auth.js:196:35
       },
     };
 
-    jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {
+    jwt.sign(payload, JWT_SECRET, {}, (err, token) => {
       if (err) throw err;
       res.json({ token });

[Killed] ObjectLiteral
backend/routes/auth.js:198:16
 
     jwt.sign(payload, JWT_SECRET, { expiresIn: '48h' }, (err, token) => {
       if (err) throw err;
-      res.json({ token });
+      res.json({});
     });
   } catch (err) {
killedBy: Auth API POST /api/auth/login 200 → valid creds
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "token": "jwt-token",
- }

[Killed] BlockStatement
backend/routes/auth.js:232:110
  *       500:
  *         description: Server error
  */
-router.post('/verify-email', [check('email', 'Please include a valid email').isEmail()], async (req, res) => {
-  const errors = validationResult(req);
-
-  if (!errors.isEmpty()) {
-    return res.status(400).json({ errors: errors.array() });
-  }
-
-  const { email } = req.body;
-
-  try {
-    let user = await User.findOne({ email });
-
-    if (!user) {
-      return res.status(400).json({ msg: 'Invalid email. User not found' });
-    }
-
-    res.json({ msg: 'Email is valid, you can proceed to reset your password' });
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server error');
-  }
-});
+router.post('/verify-email', [check('email', 'Please include a valid email').isEmail()], async (req, res) => {});
 
 /**
killedBy: Auth API POST /api/auth/verify-email 200 → email exists
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Killed] ArrayDeclaration
backend/routes/auth.js:232:30
  *       500:
  *         description: Server error
  */
-router.post('/verify-email', [check('email', 'Please include a valid email').isEmail()], async (req, res) => {
+router.post('/verify-email', [], async (req, res) => {
   const errors = validationResult(req);
 
killedBy: Auth API POST /api/auth/verify-email 400 → validation error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BlockStatement
backend/routes/auth.js:241:7
 
   const { email } = req.body;
 
-  try {
-    let user = await User.findOne({ email });
-
-    if (!user) {
-      return res.status(400).json({ msg: 'Invalid email. User not found' });
-    }
-
-    res.json({ msg: 'Email is valid, you can proceed to reset your password' });
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server error');
killedBy: Auth API POST /api/auth/verify-email 200 → email exists
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Killed] BlockStatement
backend/routes/auth.js:244:16
   try {
     let user = await User.findOne({ email });
 
-    if (!user) {
-      return res.status(400).json({ msg: 'Invalid email. User not found' });
-    }
+    if (!user) {}
 
     res.json({ msg: 'Email is valid, you can proceed to reset your password' });
killedBy: Auth API POST /api/auth/verify-email 400 → not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
backend/routes/auth.js:245:35
     let user = await User.findOne({ email });
 
     if (!user) {
-      return res.status(400).json({ msg: 'Invalid email. User not found' });
+      return res.status(400).json({});
     }
 
killedBy: Auth API POST /api/auth/verify-email 400 → not found
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "msg": "Invalid email. User not found",
- }

[Killed] StringLiteral
backend/routes/auth.js:248:21
       return res.status(400).json({ msg: 'Invalid email. User not found' });
     }
 
-    res.json({ msg: 'Email is valid, you can proceed to reset your password' });
+    res.json({ msg: "" });
   } catch (err) {
     console.error(err.message);
killedBy: Auth API POST /api/auth/verify-email 200 → email exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "msg": "Email is valid, you can proceed to reset your password",
+   "msg": "",

[NoCoverage] BlockStatement
backend/routes/auth.js:249:17
     }
 
     res.json({ msg: 'Email is valid, you can proceed to reset your password' });
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server error');
-  }
+  } catch (err) {}
 });
 

[Killed] StringLiteral
backend/routes/auth.js:286:3
  *         description: Server error
  */
 router.post(
-  '/reset-password',
+  "",
   [check('email', 'Please include a valid email').isEmail(), check('password', 'Please enter a password with 6 or more characters').isLength({ min: 6 })],
   async (req, res) => {
killedBy: Auth API POST /api/auth/reset-password 200 → reset success
statusReason: ReferenceError: setImmediate is not defined

[Killed] ArrayDeclaration
backend/routes/auth.js:287:3
  */
 router.post(
   '/reset-password',
-  [check('email', 'Please include a valid email').isEmail(), check('password', 'Please enter a password with 6 or more characters').isLength({ min: 6 })],
+  [],
   async (req, res) => {
     const errors = validationResult(req);
killedBy: Auth API POST /api/auth/reset-password 400 → validation error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
backend/routes/auth.js:287:10
  */
 router.post(
   '/reset-password',
-  [check('email', 'Please include a valid email').isEmail(), check('password', 'Please enter a password with 6 or more characters').isLength({ min: 6 })],
+  [check("", 'Please include a valid email').isEmail(), check('password', 'Please enter a password with 6 or more characters').isLength({ min: 6 })],
   async (req, res) => {
     const errors = validationResult(req);
killedBy: Auth API POST /api/auth/reset-password 200 → reset success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
backend/routes/auth.js:291:28
   async (req, res) => {
     const errors = validationResult(req);
 
-    if (!errors.isEmpty()) {
-      return res.status(400).json({ errors: errors.array() });
-    }
+    if (!errors.isEmpty()) {}
 
     const { email, password } = req.body;
killedBy: Auth API POST /api/auth/reset-password 400 → validation error
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Array

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
backend/routes/auth.js:297:9
 
     const { email, password } = req.body;
 
-    try {
-      let user = await User.findOne({ email });
-
-      if (!user) {
-        return res.status(400).json({ msg: 'Invalid email. User not found' });
-      }
-
-      const salt = await bcrypt.genSalt(10);
-      user.password = await bcrypt.hash(password, salt);
-      await user.save();
-
-      res.json({ msg: 'Password successfully reset' });
-    } catch (err) {
+    try {} catch (err) {
       console.error(err.message);
       res.status(500).send('Server error');
killedBy: Auth API POST /api/auth/reset-password 200 → reset success
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Killed] StringLiteral
backend/routes/auth.js:308:23
       user.password = await bcrypt.hash(password, salt);
       await user.save();
 
-      res.json({ msg: 'Password successfully reset' });
+      res.json({ msg: "" });
     } catch (err) {
       console.error(err.message);
killedBy: Auth API POST /api/auth/reset-password 200 → reset success
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "msg": "Password successfully reset",
+   "msg": "",

[NoCoverage] BlockStatement
backend/routes/auth.js:309:19
       await user.save();
 
       res.json({ msg: 'Password successfully reset' });
-    } catch (err) {
-      console.error(err.message);
-      res.status(500).send('Server error');
-    }
+    } catch (err) {}
   }
 );
